# 여섯번째 DP, 다섯번째 문제의 응용 문제
"""
어제푼 다섯번째 문제 접근법을 살려 응용한 문제다
1. N=1, N=2 일 때 값들을 적어보며 점화식을 만들 패턴을 찾았다.
2. 점화식을 짰다.
3. 점화식을 코드로 구현했다.
"""
n = int(input())

# (way 1)   d[i][j] = d[i-1][j] + ... + d[i-1][9]
d = [[1] * 10 for _ in range(n)]
for i in range(1, n):
    for j in range(10):
        d[i][j] = sum(d[i-1][x] for x in range(j, 10))
print(sum(d[n-1]) % 10007)

# (way 2)   (d[i][0] + ... + d[i][9]) += d[i-1][j]
d2 = [[1] * 10] + [[0] * 10 for _ in range(n-1)]
for i in range(n-1):
    for j in range(10):
        for x in range(j, 10):
            d2[i+1][x] += d2[i][j]
print(sum(d2[n-1]) % 10007)

"""
### 예상한 점화식
d[i][j] = d[i-1][j] + ... + d[i-1][9]
또는
(d[i][0] + ... + d[i][9]) += d[i-1][j]

# N = 1
0
1
2
3
4
5
6
7
8
9

# N = 2
00 01 02 03 04 05 06 07 08 09
   11 12 13 14 15 16 17 18 19
      22 23 24 25 26 27 28 29
         33 34 35 36 37 38 39
            44 45 46 47 48 49
               55 56 57 58 59
                  66 67 68 69
                     77 78 79
                        88 89
                           99
"""